/****************************************************************************************************/
/*                                                                                                  */
/*  X    X                                                                                          */
/*   X  X                                                                                           */
/*    XX ENOMORPH                                                                                   */
/*    XX ENOMORPH                                                                                   */
/*   X  X                                                                                           */
/*  X    X                    VERSION: GTTI                                                         */
/*                                                                                                  */
/****************************************************************************************************/
/*                                                                                                  */
/* (c) 2011-2012 R.J.Barnes (Codemonkey). All rights reserved                                       */  
/*                                                                                                  */
/* NOTE For upload:                                                                                 */

									16,15,15,14,14,14,13,13,12,12,12,11,11,10,10,9,9,9,8,8,7,7,7,6,6,5,5,4,4,4,3,3,2,2,1,1,1,0,0,-1,-1,-2,-2,-3,
									-3,-4,-4,-5,-5,-5,-6,-6,-7,-7,-8,-8,-9,-9,-10,-10,-11,-12,-12,-13,-13,-14,-14,-15,-15,-16,-17,-17,-18,-18,-19,
									-20,-20,-21,-22,-22,-23,-24,-25,-25,-26,-27,-28,-28,-29,-30,-31,-32,-33,-34,-35,-36,-37,-38,-39,-40,-42,-43,-44,
									-46,-47,-49,-51,-52,-55,-57,-59,-62,-65,-69,-73,-78,-86,-86};


UINT16	HAL_Tmr1Reload;
UINT16	HAL_Tmr3Reload;
UINT8 HAL_Debug;
UINT16 HAL_BoostHighCount;				/* High time of boost waveform             */
UINT16 HAL_BoostLowCount;               /* Low time of boost waveform              */
UINT16 HAL_BoostLowTrans;               /* PCA transition time of low cycle        */
UINT8 DACTransfer1;
UINT8 DACTransfer2;
UINT16 DACConv;
UINT8 DACdir;
UINT8 txmode;
UINT8 kill_ser;
UINT8 tble_idx;
UINT8 vfy_flg;
UINT8 vfy_fail;
UINT16 rxcnt;
UINT8 reinit_flag;
UINT8 can_id;
UINT16 txcnt;
UINT16 txgoal;
UINT16 kill_ser_t;
UINT16 rxoffset;
UINT16 rxnbytes;
UINT32 rxcountdown;
UINT32 lmms;
UINT16 ROM1Num;
UINT16 ROM2Num;
UINT16 ROMActivePage;
UINT16 ROMRead;
UINT8 const * ROMBurnPointer;

SINT16 HAL_TurboDuty;
SINT16 HAL_IErrorTemp;
UINT8 HAL_ADCChanSel;
UINT8 HAL_ADCLoops;
UINT8 HAL_1msScheduler;
UINT8 HAL_Task10msStart;
UINT8 HAL_10msScheduler;
UINT8 HAL_Task100msStart;
UINT8 HAL_100msScheduler;
UINT8 HAL_1SScheduler;
UINT8 HAL_BoostSchedule;
UINT32 HAL_kEngineSpeed;
UINT16 HAL_EnginePeriod;
UINT16 HAL_EnginePrevious;
UINT8 HAL_EngineOverflow;
UINT32 HAL_kVehicleSpeed;
UINT16 HAL_VehiclePeriod;
UINT16 HAL_VehiclePrevious;
UINT8 HAL_VehicleOverflow;
UINT8 HAL_InjAtInterrupt;
UINT8 HAL_SpkAtInterrupt;
UINT16 HAL_FuelStart;
UINT16 HAL_FuelEnd;
UINT16 HAL_FuelPulseTime;
UINT16 HAL_FuelFactor;
UINT16 HAL_FuelUnscaled;
UINT8 IGN_AnglePerCylinder;
UINT16 HAL_SparkStartPrev;
UINT16 HAL_SparkStart;
UINT16 HAL_SparkEnd;
UINT16 FUEL_TimeTemp;
UINT16 FUEL_OverallTemp;
UINT8  FUEL_OverallFact;
UINT8  FUEL_IncreaseFact;
UINT8  FUEL_IncreaseISR;
UINT16 HAL_FuelExtend;
UINT16 HAL_FuelExtendISR;
UINT8 HAL_InjThisCycle;
UINT8 HAL_InjSync;
UINT8 HAL_IgnSync;
UINT8 HAL_T0Count;
UINT8 HAL_T1Count;
UINT8 HAL_T2Count;
UINT8 HAL_T3Count;
UINT8 HAL_FuelCounter;
UINT8 HAL_PCA0Count;
UINT8 HAL_BackgroundCnt;
UINT8  VS_KPHFact;
UINT8 * TURBO_PtrMaxBoostGr;
UINT16 TURBO_LimitGear;
UINT16 BOBEngineSpeed;
UINT16 BOBEngineSpeedd;
UINT16 BOBMap;
SINT8 BOBCorAngleMap;
UINT8 BOBCorFactMap;
UINT8 BOBTurboDuty;
UINT16 VS_RatioSplits[7];
UINT16	VS_FTDropToRPM;
UINT16  VS_GearRatio[8];
SINT16 IOP_VehicleDelta;
UINT16 IOP_Vehicle;
UINT8 ClutchType;
UINT8 HAL_TurboMapSel;
UINT8 HAL_IgnMapSel;
UINT8 HAL_FuelMapSel;
#ifdef REVENG
UINT16 HAL_IgnitionDelay;
UINT16 HAL_DistribTime;
#endif
UINT16 HAL_EnginePeriod720;
UINT16 IOP_MAPHist[MAPHISTLEN];

SINT8 IGN_TableLookup(UINT8 rpm, UINT8 map, UINT8 mapselect);
UINT8 FUEL_TableLookup(UINT8 rpm, UINT8 map, UINT8 mapselect);
UINT8 TURBO_DutyTableLookup(UINT8 rpm, UINT8 tps, UINT8 mapselect);
UINT8 TURBO_TargetTableLookup(UINT8 rpm, UINT8 tps, UINT8 mapselect);
UINT8 HAL_O2Lookup(UINT8 Raw);

typedef struct {

/* Inputs - raw inputs  - Note: ORDER!! */
	UINT16 HAL_Seconds;                             /* Time in seconds                  *//*  0*/
    UINT8 HAL_ANA1;                                 /* ADC counts - Analogue in 1       *//*  2*/
    UINT8 HAL_ManPressRaw;							/* ADC counts - manifold pressure   *//*  3*/
	UINT8 HAL_CoolTempRaw;							/* ADC counts - Coolant temperature *//*  4*/
	UINT8 HAL_AirInletRaw;                          /* ADC counts - Air inlet temp.     *//*  5*/
	UINT8 HAL_ThrottleRaw;							/* ADC counts - Throttle Position   *//*  6*/
	UINT8 HAL_O2SensorRaw;							/* ADC counts - O2 Sensor           *//*  7*/
	UINT8 HAL_VBattRaw;								/* ADC counts - V Battery Supply    *//*  8*/
	UINT8 HAL_VSenseRaw;							/* ADC counts - V Sensor supply		*//*  9*/

/* Inputs - post conversion */
	UINT16 IOP_EngineSpeedd;						/* x 1 Engine rotational speed   	*//* 10*/
    UINT16 IOP_ManifoldPressd;						/* x 10 Manifold Pressure kPa		*//* 12*/
	UINT8  IOP_ThrottlePos;							/* x 1 Throttle Position %          *//* 14*/
	SINT8  IOP_AirInletTemp;						/* x 1 Air inlet temperature C      *//* 15*/
	SINT8  IOP_CoolantTemp;							/* x 1 Coolant temperature C        *//* 16*/
	UINT8  IOP_BatteryVolts;						/* x 10 ECU Supply voltage V        *//* 17*/
	UINT8  IOP_SensorVolts;							/* x 10 Sensor supply voltage V     *//* 18*/
	UINT8  IOP_AirFuelRatio;						/* x 10 Air Fuel Ratio X:1          *//* 19*/

/* Fuel variables */
	UINT16 FUEL_CorFactSized;						/* x 1000 injector resize factor 	*//* 20*/
	UINT16 FUEL_CorFactMapd;                        /* x 1000 injector map factor       *//* 22*/
	UINT16 FUEL_BaseTimed;							/* Base injection time from input   *//* 24*/
	UINT16 FUEL_CorrectTimed;						/* Corrected injection time         *//* 26*/

/* Spark variables */
	UINT16 IGN_SparkPeriodd;						/* Time between spark event         *//* 28*/
    UINT8  IOP_OpMode;                              /* Operating mode of the controller *//* 30*/
	UINT8  IOP_Auxilliary;                          /* Auxilliary bits                  *//* 31*/
	SINT16 IGN_CorAngleMapd;						/* Correction angle from map        *//* 32*/
	UINT16 IGN_SparkHighd;                          /* High time of spark pulse         *//* 34 */
	UINT16 IGN_SparkTriggerd;						/* Delay from rising spark til next *//* 36 */
    UINT8  TURBO_ValveDuty;                         /* Turbo control valve duty demand  *//* 38 */

/* Outputs */
	UINT8  IOP_MapSwitches;                         /* Map select switch data           *//* 39 */
	UINT8  DAC_FakeCounts;							/* Fake signal DAC counts after lim *//* 40 */
	UINT8  HAL_Checksum;                            /* Checksum for sector              *//* 41 */
	UINT8  TURBO_Feedforward;                       /* Turbo control open loop demand   *//* 42 */
	UINT16 TURBO_MAPTargetd;                        /* Turbo control target pressure    *//* 43 */
	SINT16 TURBO_MAPErrord;							/* Turbo control pressure error     *//* 45 */
	SINT16 TURBO_MAPPTermd;							/* Turbo control proportional term  *//* 47 */
	SINT16 TURBO_MAPITermd;							/* Turbo control integral term      *//* 49 */
    UINT8  HAL_Burn;                                /* Flag indicating that burn needed *//* 51 */
	UINT8  TURBO_ClosedLoop;						/* Flag indicating boost control on *//* 52 */
	UINT16 VS_VehicleSpeedd;                        /* Vehicle indicated speed          *//* 53 */          
	UINT8  VS_Gear;                                 /* Vehicle indicated gear           *//* 55 */          
	UINT16 VS_Vehiclekphd;                          /* Vehicle indicated speed kph      *//* 56 */
	UINT16 VS_Ratiod;                               /* Calculated gear ratio            *//* 58 */
    UINT8  VS_ClutchBits;                           /* Status bit of the clutch system  *//* 60 */
    UINT16 VS_EngLimClutchd;                        /* Maximum engine speed for clutch  *//* 61 */
	UINT8  IOP_CutBits;                             /* Cut status bits                  *//* 63 */
	UINT8  IOP_ClutchSwitch;                        /* Clutch switch status             *//* 64 */
	UINT16 VS_ClutchTimer;                          /* Clutch system timer              *//* 65 */
	SINT8  IGN_FinalAngle;                          /* Final spark alteration angle     *//* 67 */
	SINT8  IGN_ClutchRetard;                        /* Spark alteration angle clutch    *//* 68 */
	UINT8  DEBUG;									/* Debug                            *//* 69 */
	SINT16 IOP_dManifold;							/* Rate of change of MAP            *//* 70 */
    SINT16 TURBO_MAPDTerm;                          /* Derivative term of turbo control *//* 72 */
	UINT16 IOP_EngineSpeed;							/* x 1 Engine rotational speed   	*//* 74 */
    UINT16 IOP_ManifoldPress;						/* x 10 Manifold Pressure kPa		*//* 76 */
	UINT8  FUEL_CorFactSize;						/* x 1000 injector resize factor 	*//* 78 */
	UINT8  FUEL_CorFactMap;                         /* x 1000 injector map factor       *//* 79 */
	UINT16 FUEL_BaseTime;							/* Base injection time from input   *//* 80 */
	UINT16 FUEL_CorrectTime;						/* Corrected injection time         *//* 82 */
	UINT16 IGN_SparkPeriod;							/* Time between spark event         *//* 84 */
	SINT8  IGN_CorAngleMap;							/* Correction angle from map        *//* 86 */
	UINT16 IGN_SparkHigh;                           /* High time of spark pulse         *//* 87 */
	UINT16 IGN_SparkTrigger;						/* Delay from rising spark til next *//* 89 */
	UINT16 TURBO_MAPTarget;                         /* Turbo control target pressure    *//* 91 */
	SINT16 TURBO_MAPError;							/* Turbo control pressure error     *//* 93 */
	SINT16 TURBO_MAPPTerm;							/* Turbo control proportional term  *//* 95 */
	SINT16 TURBO_MAPITerm;							/* Turbo control integral term      *//* 97 */
    UINT16 VS_Ratio;                                /* Calculate gear ratio             *//* 99 */
	UINT8  TURBO_CutCounter;                        /* Counter for overboost detect     *//*101 */
	UINT8  TURBO_OkayCounter;                       /* Counter for okayboost detect     *//*102 */
	UINT16 VS_EngLimClutch;                         /* Engine speed limit from clutch   *//*103 */
	UINT16 IOP_VehicleSpeed;						/* Vehicle speed RPM                *//*105 */
	UINT16 IOP_VehicleSpeedKph;                     /* Vehicle speed KPH                *//*107 */
	UINT16 VS_OveralLimiter;                        /* Engine speed limit RPM           *//*109 */
	UINT8  DAC_FakeCountsUL;						/* Fake signal DAC counts before lim*//*111 */
}VarForMonitor;


VarForMonitor Vars;


typedef struct {

/* IOP Input Parameters */
	UINT8  HAL_THROTTLEMIN;             /* 0   */  /* Raw counts for 0% throttle      	x1  	*/
	UINT8  HAL_THROTTLEMAX;             /* 1   */  /* Raw counts for 100% throttle    	x1  	*/
	UINT8  HAL_MAPMIN;                  /* 2   */  /* Raw counts for minimum MAP      	x1  	*/
	UINT8  HAL_MAPMAX;                  /* 3   */  /* Raw counts for maximum MAP      	x1  	*/
    UINT8  IOP_MAXMAPPRESS;			    /* 4   */  /* Maximum MAP pressure kPa        	x12  	*/	
/* DAC sensor parameters  */
	UINT8  DAC_FAKEMAPMIN;			    /* 5   */  /* Raw counts for min fake MAP     	x1  	*/
	UINT8  DAC_FAKEMAPMAX;              /* 6   */  /* Raw counts for max fake MAP     	x1  	*/
	UINT8  DAC_FAKEMAXMAPPRESS;		    /* 7   */  /* Maximum MAP pressure kPa fake   	x12  	*/
	UINT8  DAC_FAKEFCDMAX;			    /* 8   */  /* Fuel cut defender limit on Fake 	x1  	*/	
/* General parameters */
	UINT8  IOP_ENGINESTALLSPEED;	    /* 9   */  /* Stalling speed of engine RPM    	x64  	*/
	UINT8  IOP_ENGINESYNCSPEED;		    /*10   */  /* Sync speed of engine RPM        	x64  	*/
	UINT8  IOP_NUMBEROFCYLS;            /*11   */  /* Engine number of cyls (3-8)     	x1  	*/
    UINT8  IOP_OPERATINGMODE;           /*12   */  /* Requested operating mode        	Enum  	*/
/* FUEL Fuel parameters */
	UINT8  FUEL_STDINJSIZE;			    /*13   */  /* Standard injector size (cc)     	x2  	*/
	UINT8  FUEL_NEWINJSIZE;			    /*14   */  /* New injector size (cc)          	x2	 	*/
	UINT8  IOP_FUELMAPSELECT;           /*15   */  /* Fuel map selection              	bool  	*/  
	UINT8  IOP_IGNMAPSELECT;            /*16   */  /* Ignition map selection          	bool  	*/  
	UINT8  IOP_TURBOMAPSELECT;          /*17   */  /* Turbo map selection             	bool  	*/  
	UINT8  TURBO_PGAIN;					/*18   */  /* Proportional gain of boost controller     */
	UINT8  TURBO_IGAIN;					/*19   */  /* Integral gain of the boost controller     */
	SINT8  TURBO_ITERMMIN;				/*20   */  /* Minimum output of boost controller        */
	SINT8  TURBO_ITERMMAX;				/*21   */  /* Maximum output of boost controller        */
	UINT8  TURBO_MINMAPCL;				/*22   */  /* Minimum map for closed loop       x12     */
    UINT8  TURBO_MINTHROTTLE;           /*23   */  /* Minimum throttle for closed loop          */
	UINT8  TURBO_OFFDUTY;               /*24   */  /* Valve duty for valve off condition        */
	UINT8  TURBO_MAXDUTY;               /*25   */  /* Valve duty for maximum bleed              */
	UINT8  TURBO_MINDUTY;               /*26   */  /* Valve duty for minimum bleed when not off */
	SINT8  TURBO_MINIERROR;             /*27   */  /* Minimum I part error going into I calc    */
	SINT8  TURBO_MAXIERROR;             /*28   */  /* Maximum I part error going into I calc    */
	UINT8  FUEL_MAXGRADIENT;			/*29   */  /* Maximum gradient of fuel factor /10ms     */
	UINT8  IGN_MAXGRADIENT;             /*30   */  /* Maximum gradient of ign advance /10ms     */
    UINT8  VS_MAXFAKEGEAR;              /*31   */  /* Maximum gear for fake output speed   x1   */
	UINT16 VS_RATIO1;					/*32   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO2;					/*34   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO3;					/*36   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO4;					/*38   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO5;					/*40   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO6;					/*42   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIO7;					/*44   */  /* Transmission overall ratio          x100  */
	UINT16 VS_RATIOR;					/*46   */  /* Transmission overall ratio          x100  */
    UINT8  TURBO_GR1MAXBOOST;           /*48   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR2MAXBOOST;           /*49   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR3MAXBOOST;           /*50   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR4MAXBOOST;           /*51   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR5MAXBOOST;           /*52   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR6MAXBOOST;           /*53   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GR7MAXBOOST;           /*54   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_GRRMAXBOOST;           /*55   */  /* Maximum boost against gear          x12   */      
    UINT8  TURBO_BOOSTCUT;              /*56   */  /* Maximum boost limit - cut           x12   */
    UINT8  TURBO_BOOSTOKAY;             /*57   */  /* Maximum boost limit - restart       x12   */
    UINT8  TURBO_CUTTIME;               /*58   */  /* Time at cut limit before cut        x100  */   
    UINT8  TURBO_OKAYTIME;              /*59   */  /* Time at okay before restart         x100  */
	UINT8  VS_TYREWIDTH;                /*60   */  /* Tyre width (mm)                     x1    */ 
	UINT8  VS_TYREPROFILE;              /*61   */  /* Tyre profile (%)                    x1    */
	UINT8  VS_TYREDIAMETER;             /*62   */  /* Tyre diameter (inch)                x10   */
    UINT8  VS_LAUNCHRPM;                /*63   */  /* Launch control stall RPM            x64   */
	UINT8  VS_LAUNCHMAXVEHICLE;         /*64   */  /* Maximum vehicle RPM for launch      x64   */
	UINT8  VS_LIMITERHYST;              /*65   */  /* Engine limiter hysteresis           x64   */
	UINT8  VS_FTSHIFTMAXRISE;           /*66   */  /* Full throttle shift RPM max rise    x64   */
	UINT8  VS_FTMINTHROTTLE;            /*67   */  /* Min throttle for full throttle shiftx1    */
	UINT8  VS_FTMAXTIME;                /*68   */  /* Timeout of FT gear shifts           x10   */
	UINT8  VS_CLUTCHOPTIONS;            /*69   */  /* Clutch option bits                        */
	UINT8  VS_LIMITEROPTIONS;           /*70   */  /* Limiter option bits                       */
	UINT8  IOP_MAXENGINESPEED;          /*71   */  /* Engine speed artificial limiter     x64   */
	SINT8  VS_LCRETARDLIMIT;            /*72   */  /* Limit of spark retard for launch use x1   */
    UINT8  VS_LCRPMRETARDGAIN;          /*73   */  /* Prop gain of RPM controller         x1/256*/
    UINT8  VS_FTDROPTIME;               /*74   */  /* Time until RPM drop for full throt. x10   */
    UINT8  VS_LCMAXTIME;                /*75   */  /* Timeout for launch stall            x10   */
	UINT8  VS_FTSHIFTTARGABOVE;         /*76   */  /* Full throttle margin above coming   x64   */
	UINT8  VS_LCACTTHROTTLE;            /*77   */  /* Min throttle for launch             x1    */
	UINT8  VS_LCDISTHROTTLE;            /*78   */  /* Throttle for launch cancel          x1    */
	UINT8  VS_FTFALLSPEEDGRAD;          /*79   */  /* Falling speed gradient for WOT shftx1/10ms*/
	UINT8  VS_FTRPMRETARDGAIN;          /*80   */  /* Prop gain of RPM controller         x1/256*/
    SINT8  VS_VEHICLEMAXRISE;			/*81   */  /* Rising speed gradient for veh. spd.x1/10ms*/
    SINT8  VS_VEHICLEMAXFALL;			/*82   */  /* Falling speed gradient for veh.spd.x1/10ms*/
    SINT8  VS_VEHICLEMAXRISELC;			/*83   */  /* LC    speed gradient for veh. spd.x1/10ms */
	SINT8  VS_FTRETARDLIMIT;            /*84   */  /* Limit of spark retard for shift use  x1   */
	UINT8  HAL_O2RAWTABLE[HAL_O2_PTS];	/*85   */  /* Raw data axis points of O2 sensor x 1     */
	UINT8  HAL_O2VALTABLE[HAL_O2_PTS];  /*92   */  /* Actual value (AFR) points         x 10    */
	UINT8  IOP_ANIN1FUNCTION;			/*99   */  /* Function of ANIN1 input           x 1     */
    SINT8  IOP_TEMPDRIVEON;             /*100  */  /* Temperature for drive on          x 1     */
    SINT8  IOP_TEMPDRIVEOFF;            /*101  */  /* Temperature for drive off         x 1     */
	UINT8  IOP_TPSDRIVEON;              /*102  */  /* Throttle for drive on             x 1     */
	UINT8  IOP_TPSDRIVEOFF;             /*103  */  /* Throttle for drive off            x 1     */
	UINT8  TESTFIXES;                   /*104  */  /* For debug purposes                        */
	UINT8  TURBO_DMAPDELAY;             /*105  */  /* Delay time of delta MAP           x 10ms  */
	SINT8  TURBO_DGAIN;					/*106  */  /* Derivative gain of turbo control          */
	UINT8  pad2;                        /*107  */
	UINT32 Paddingpg[37];               /*108  */

} ParGlobals;   /* Page size 256 */

typedef struct {
/* FUEL Fuelling parameters */
	UINT8  FUEL_RPMTABLE[FUEL_RPM_PTS];/*   0*/  /* Engine speed axis data - Fuel   */
	UINT8  FUEL_MAPTABLE[FUEL_MAP_PTS];/*   16*/  /* MAP sensor axis data - Fuel     */
	UINT8  FUEL_PRCNTCORRTABLE[FUEL_MAP_PTS][FUEL_RPM_PTS];  /*   32*/  /* Fuel table                      */
															 /*  288*/
	UINT32 Paddingfm[56]; 	
} FuelMaps;                             /* Page size 512 */
					
typedef struct {
/* IGN ignition parameters */
	UINT8  IGN_RPMTABLE[SPARK_RPM_PTS];/*    0*/   /* Engine speed axis data - Ign    */
	UINT8  IGN_MAPTABLE[SPARK_MAP_PTS];/*   16*/   /* MAP sensor axis data - Ign      */
	SINT8  IGN_IGNOFFTABLE[SPARK_MAP_PTS][SPARK_RPM_PTS]; /*  32*/	/* Ignition offset table           */
															 /*  288*/
	UINT32 Paddingim[56]; 		
} IgnMaps;                             /* Page size 512 */

																				
typedef struct {
/* TURBO turbo control parameters */
	UINT8  TURBO_DUTYRPMTABLE[TURBO_DUTY_RPM_PTS];  /*   0*/ /* Engine speed axis data - boost */
										
	UINT8  TURBO_DUTYTPSTABLE[TURBO_DUTY_TPS_PTS];  /*   8*//* Throttle pos axis data - boost */
										             
	UINT8  TURBO_DUTYTABLE[TURBO_DUTY_TPS_PTS][TURBO_DUTY_RPM_PTS];	/*  16*/ /* Duty request data table        */

	UINT8  TURBO_TARGRPMTABLE[TURBO_TARG_RPM_PTS]; /*   80*/ /* Engine speed axis data - boost */

	UINT8  TURBO_TARGTPSTABLE[TURBO_TARG_TPS_PTS]; /*   88*/ /* Throttle pos axis data - boost */

	UINT8  TURBO_TARGTABLE[TURBO_TARG_TPS_PTS][TURBO_TARG_RPM_PTS]; /*  96*/ /* MAP request data table        */
													/*  160*/	 
	UINT32 Paddingbm[87]; 		
	UINT16 ValidateLong;
	UINT16 PageCounter;
} BoostMaps;                            /* Page size 512 */



// ram copy of inputs
SEG_XDATA ParGlobals 	 	GlobalsRAM;
SEG_XDATA FuelMaps	 		Fuel1RAM;
SEG_XDATA IgnMaps		 	Ign1RAM;
SEG_XDATA BoostMaps	 		Boost1RAM;
SEG_XDATA FuelMaps	 		Fuel2RAM;
SEG_XDATA IgnMaps		 	Ign2RAM;
SEG_XDATA BoostMaps	 		Boost2RAM;
// Duplicate pages starting at 0xD000


#define HAL_RXBUFFSIZE			256
UINT8 rxbuf[HAL_RXBUFFSIZE];


// flash copy of inputs - initialized
const ParGlobals __at(0xC000) GlobalsROM  = {

/* IOP Input Parameters */
    18,  /* HAL_THROTTLEMIN    */
	144, /* HAL_THROTTLEMAX    */
    0,   /* HAL_MAPMIN         */
	255, /* HAL_MAPMAX         */
    177, /* IOP_MAXMAPPRESS    */
	0,	 /*  DAC_FAKEMAPMIN Raw counts for min fake MAP          */
